app/views/teams/show.html.erb

<ul>
	<% @team.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."team_id" = 1

<ul>
	<% @team.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "team_memberships" ON "users"."id" = "team_memberships"."user_id" WHERE "team_memberships"."team_id" = 1