app/views/users/_form.html.erb

	<h4> Teams: </h4>
	<% Team.all.each do |team| %>
		<%=
			check_box_tag(
				"user[team_ids][]",
				team.id,
				@user.team_ids.include?(team.id),
				:id => "user_team_ids_#{team.id}"
				)
---
SELECT "teams".* FROM "teams"
SELECT "teams".id FROM "teams" INNER JOIN "team_memberships" ON "teams"."id" = "team_memberships"."team_id" WHERE "team_memberships"."user_id" IS NULL