app/views/users/show.html.erb

SELECT "teams".* FROM "teams" INNER JOIN "team_memberships" ON "teams"."id" = "team_memberships"."team_id" WHERE "team_memberships"."user_id" = 1
---
<ul>
	<% @user.teams.each do |team| %>