app/views/projects/_form.html.erb

SELECT "teams".* FROM "teams"
---
	<%=f.label :team_id, "Team" %>
  <%= f.collection_select(:team_id, Team.all, :id, :name) %>