app/views/items/_form.html.erb

	<%=f.label :project_id, "Project" %>
  <%= f.collection_select(:project_id, Project.all, :id, :title) %>
---
SELECT "projects".* FROM "projects"