app/views/items/index.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
---

<form action=<%= batch_update_project_items_url(@items.first.project) %> method="post" >