app/controllers/items_controller.rb

	def index
		if params[:project_id]
			@items = Item.where(:project_id => params[:project_id])
		else
			@items = Item.all
---
SELECT "items".* FROM "items" WHERE "items"."project_id" = 1 LIMIT 1
SELECT "items".* FROM "items"

	def create
		@item = Item.new(params[:item])
		if @item.save
---
INSERT INTO "items" ("completed", "created_at", "descript", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["completed", 0], ["created_at", Fri, 05 Apr 2013 18:44:50 UTC +00:00], ["descript", "asdfasdfasdf"], ["project_id", 1], ["title", "first"], ["updated_at", Fri, 05 Apr 2013 18:44:50 UTC +00:00]]

	def update
		@item = Item.find(params[:id])
		@item.update_attributes(params[:item])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "items" SET "completed" = 1, "updated_at" = '2013-04-05 21:22:12.139679' WHERE "items"."id" = 1

	def batch_update
		update_hash = params.select {|key,value| key.to_i != 0}
		update_hash.each do |key, value|
			item = Item.find(key.to_i)
			if value == "on"
				item.completed = 1
				puts key
			else
				item.completed = 0
			end
			item.save
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "items" SET "completed" = 0, "updated_at" = '2013-04-06 00:04:54.896077' WHERE "items"."id" = 1