app/controllers/projects_controller.rb

	def create
		@project = Project.new(params[:project])
		if @project.save
---
INSERT INTO "projects" ("created_at", "descript", "item_ids", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 05 Apr 2013 18:44:41 UTC +00:00], ["descript", " asdfasdfa"], ["item_ids", nil], ["title", "Test1"], ["updated_at", Fri, 05 Apr 2013 18:44:41 UTC +00:00]]

	def update
		@project = Project.find(params[:id])
		@project.update_attributes(params[:project])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "team_id" = 2, "updated_at" = '2013-04-05 21:18:39.942542' WHERE "projects"."id" = 1