app/controllers/teams_controller.rb

INSERT INTO "teams" ("created_at", "name", "project_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 05 Apr 2013 20:25:25 UTC +00:00], ["name", "Blue Team"], ["project_id", nil], ["updated_at", Fri, 05 Apr 2013 20:25:25 UTC +00:00]]
---
	def create
		@team = Team.new(params[:team])
		if @team.save

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "3"]]
---
	def update
		@team = Team.find(params[:id])