app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 05 Apr 2013 21:07:14 UTC +00:00], ["name", "Eric"], ["updated_at", Fri, 05 Apr 2013 21:07:14 UTC +00:00]]
---
	def create
		@user = User.new(params[:user])
		if @user.save